# API_ML_AI
### PRD
字段简述如下：

- Target release: 发布日期
- Epic:
1. 故事stories：当用户到一个地方想要买车或者修理车子，但不清楚当地的4S店具体所在位置，以及不了解某种车品牌的4S店在当地的分布情况。这时，用户想需要一个可以提供当地所有4S店所在位置，并且能够根据车品牌查询该品牌在当地的所有4s店面的位置。
2. 史诗 epic：可以结合地图软件进行一个购车指南，帮助用户在看车购车上选择最优的路线。另外，当用户爱车出现故障需要送去维修时，也可以根据用户目前所在位置，为用户提供附近最近的4s店面或者汽车修配厂的位置以及联系方式.
- Document Status: 文件现状，进行中
- Document owner: 叶家杰
- Designer: 叶家杰
- Developer: 叶家杰
- QA: 领头的测试者
- Goals: 目标，提供用户购车看车最优线路。
- Background and strategic fit:
1. 背景：当用户到一个地方想要买车或者修理车子，但不清楚当地的4S店具体所在位置，以及不了解自己某种车品牌的4S店在当地的分布情况。
2. 战略契合处：可以结合地图软件进行一个购车指南，帮助用户在看车购车上选择最优的路线。
- Assumptions: 用户使用此主要功能时，主要是在使用手机。查询地图时。
- 需求 Requirements：用户需要得到某种车品牌当地4s店的位置。
- 所对映的标题（Title）：车品牌、车型号。
- 重要程度（Importance）十分重要。
- 笔记（Note）
- 使用者交互及设计: User interaction and design ：输入车品牌/车型———得到附近所有该车品牌/车型号的4s门店位置。
- 问题 Questions: 列出以上需求文件做完旳话可以完成什麽样的问题
- 不做 Not doing: 列出诗论及记录过的功能，超出范围的功能，下一版再改进的功能，都放在这
